
local num = 10
print(num%360)


print('------------------------------\n')
--x = math.pi
x = 0.123456
print(x - x%1)		-- x%1 为小数部分
print(x - x%0.01)

print('------------------------------\n')
a = 10
print(a^(1/2))		-- 很奇怪不是3.333333333

print('------------------------------\n')
a = {}
a.x = 1
a.y = 2

b = {}
b.x = 1
b.y = 2

a = c

print(a == c)
print(a == b)

print('------------------------------\n')
a = 'abcd'
b = 'bcd'
print(a <= b)

print('------------------------------\n')
--print(2 < '15')		-- 类型不同，不可以比较

print('------------------------------\n')

print(100 / 7)
print(100 % 7)
print((100 / 7 - (100 % 7) / 7)) 
